Capstone project - Python Fundamentals

In [57]:
import numpy as pd
import pandas as pd

Task1 - There are three different tables as given above. Please make three dataframe in python and save them as three .csv files. From Task 2 to Task 10, use the saved .csv files only.

In [58]:
# Project data Frame
ProjectData = {'ID': ['A001', 'A002', 'A003', 'A004', 'A005', 'A002', 'A005', 'A003', 'A001', 'A003', 'A001', 'A004', 'A004', 'A005'],
    'Project': ['Project 1', 'Project 2', 'Project 3', 'Project 4', 'Project 5', 'Project 6', 'Project 7', 'Project 8', 'Project 9', 
                'Project 10', 'Project 11', 'Project 12', 'Project 13', 'Project 14'],
    'Cost': [1002000, 2000000, 4500000, 5500000, None, 680000, 400000, 350000, None, 300000, 2000000, 1000000, 3000000, 200000],
    'Status': ['Finished', 'Ongoing', 'Finished', 'Ongoing', 'Finished', 'Failed', 'Finished', 'Failed', 'Ongoing', 
               'Finished', 'Failed', 'Ongoing', 'Finished', 'Finished']}

ProjectDataframe = pd.DataFrame(ProjectData)

ProjectDataframe.to_csv('ProjectDateFrame.csv', index=False)
ProjectDataframe

      ID     Project       Cost    Status
0   A001   Project 1  1002000.0  Finished
1   A002   Project 2  2000000.0   Ongoing
2   A003   Project 3  4500000.0  Finished
3   A004   Project 4  5500000.0   Ongoing
4   A005   Project 5        NaN  Finished
5   A002   Project 6   680000.0    Failed
6   A005   Project 7   400000.0  Finished
7   A003   Project 8   350000.0    Failed
8   A001   Project 9        NaN   Ongoing
9   A003  Project 10   300000.0  Finished
10  A001  Project 11  2000000.0    Failed
11  A004  Project 12  1000000.0   Ongoing
12  A004  Project 13  3000000.0  Finished
13  A005  Project 14   200000.0  Finished

In [59]:
# Employee Data Frame 
Employeedata = {'ID':['A001','A002','A003','A004','A005'],
        'Name':['John Alter','Alice Luxumberg','Tom Sabestine','Nina Adgra','Amy Johny'],
        'Gender':['M', 'F', 'M', 'F', 'F'],
        'City':['Paris','London','Berlin','Newyork','Madrid'],
        'Age': [25,27,29,31,30]}
EmployeeDataFrame = pd.DataFrame(Employeedata)

EmployeeDataFrame.to_csv('EmployeeDataFrame.csv', index=False)
EmployeeDataFrame

     ID             Name Gender     City  Age
0  A001       John Alter      M    Paris   25
1  A002  Alice Luxumberg      F   London   27
2  A003    Tom Sabestine      M   Berlin   29
3  A004       Nina Adgra      F  Newyork   31
4  A005        Amy Johny      F   Madrid   30

In [60]:
# Seniority Level Data Frame
Seniorityleveldata={'ID':['A001','A002','A003','A004','A005'],
                   'Designation Level':[2,2,3,2,3]}
SeniorityLevelDataFrame=pd.DataFrame(Seniorityleveldata)
SeniorityLevelDataFrame.to_csv('SeniorityLevelDataFrame.csv', index=False)
SeniorityLevelDataFrame

     ID  Designation Level
0  A001                  2
1  A002                  2
2  A003                  3
3  A004                  2
4  A005                  3

In [61]:
# File into a pandas Projectdataframe
Projectdataframe = pd.read_csv(r'C:\Users\Narendra\ProjectDateFrame.csv')
print(Projectdataframe)

      ID     Project       Cost    Status
0   A001   Project 1  1002000.0  Finished
1   A002   Project 2  2000000.0   Ongoing
2   A003   Project 3  4500000.0  Finished
3   A004   Project 4  5500000.0   Ongoing
4   A005   Project 5        NaN  Finished
5   A002   Project 6   680000.0    Failed
6   A005   Project 7   400000.0  Finished
7   A003   Project 8   350000.0    Failed
8   A001   Project 9        NaN   Ongoing
9   A003  Project 10   300000.0  Finished
10  A001  Project 11  2000000.0    Failed
11  A004  Project 12  1000000.0   Ongoing
12  A004  Project 13  3000000.0  Finished
13  A005  Project 14   200000.0  Finished

In [62]:
# File into a pandas EmployeeDataFrame
EmployeeDataFrame = pd.read_csv(r'C:\Users\Narendra\EmployeeDataFrame.csv')
print(EmployeeDataFrame)

     ID             Name Gender     City  Age
0  A001       John Alter      M    Paris   25
1  A002  Alice Luxumberg      F   London   27
2  A003    Tom Sabestine      M   Berlin   29
3  A004       Nina Adgra      F  Newyork   31
4  A005        Amy Johny      F   Madrid   30

In [63]:
# File into a pandas SeniorityLevelDataFrame
SeniorityLevelDataFrame = pd.read_csv(r'C:\Users\Narendra\SeniorityLevelDataFrame.csv')
print(SeniorityLevelDataFrame)

     ID  Designation Level
0  A001                  2
1  A002                  2
2  A003                  3
3  A004                  2
4  A005                  3

Task2 - The cost column in the dataframe “Project” has some missing values. Your task is to compute these missing values. Replace the missing values by running average. You should use the “For” loop for this task.

In [64]:
# Missing values in Cost
project_df = pd.DataFrame(Projectdataframe)
#track of the running sum and count
running_sum = 0 
count = 0
#replace missing values
for index, row in project_df.iterrows():
    if pd.isna(row['Cost']):
        project_df.at[index, 'Cost'] = running_sum / count if count > 0 else 0
    else:
        running_sum += row['Cost']
        count += 1
## Display the updated dataframe
print(Projectdataframe)

      ID     Project          Cost    Status
0   A001   Project 1  1.002000e+06  Finished
1   A002   Project 2  2.000000e+06   Ongoing
2   A003   Project 3  4.500000e+06  Finished
3   A004   Project 4  5.500000e+06   Ongoing
4   A005   Project 5  3.250500e+06  Finished
5   A002   Project 6  6.800000e+05    Failed
6   A005   Project 7  4.000000e+05  Finished
7   A003   Project 8  3.500000e+05    Failed
8   A001   Project 9  2.061714e+06   Ongoing
9   A003  Project 10  3.000000e+05  Finished
10  A001  Project 11  2.000000e+06    Failed
11  A004  Project 12  1.000000e+06   Ongoing
12  A004  Project 13  3.000000e+06  Finished
13  A005  Project 14  2.000000e+05  Finished

Task3 - Split the name column in the Employee dataframe into two new columns “First Name”, and “Last Name” and remove the older “name” column.

In [65]:
employee_df = pd.DataFrame(EmployeeDataFrame)
#Split the 'name' column into 'First' and 'Last' Name
employee_df[['First Name','Last Name']] = employee_df['Name'].str.split(' ', expand=True)
#update the old 'name' column
employee_df = employee_df.drop(columns=['Name'])
# Display the updated dataframe
print(employee_df)

     ID Gender     City  Age First Name  Last Name
0  A001      M    Paris   25       John      Alter
1  A002      F   London   27      Alice  Luxumberg
2  A003      M   Berlin   29        Tom  Sabestine
3  A004      F  Newyork   31       Nina      Adgra
4  A005      F   Madrid   30        Amy      Johny

Task4 - Join all three dataframes in one single dataframe. Name it “Final”

In [66]:
employee_df = pd.DataFrame(EmployeeDataFrame)
project_df = pd.DataFrame(Projectdataframe)
SeniorityLevelDataFrame=pd.DataFrame(SeniorityLevelDataFrame)

# Merge Employee and Project dataframes on 'employee_id'
Final = pd.merge(project_df, employee_df, on ="ID", how="left")  
Final = pd.merge(Final,SeniorityLevelDataFrame , on="ID", how="left")

# Display the final dataframe
print(Final)

      ID     Project          Cost    Status             Name Gender     City  \
0   A001   Project 1  1.002000e+06  Finished       John Alter      M    Paris
1   A002   Project 2  2.000000e+06   Ongoing  Alice Luxumberg      F   London
2   A003   Project 3  4.500000e+06  Finished    Tom Sabestine      M   Berlin
3   A004   Project 4  5.500000e+06   Ongoing       Nina Adgra      F  Newyork
4   A005   Project 5  3.250500e+06  Finished        Amy Johny      F   Madrid
5   A002   Project 6  6.800000e+05    Failed  Alice Luxumberg      F   London
6   A005   Project 7  4.000000e+05  Finished        Amy Johny      F   Madrid
7   A003   Project 8  3.500000e+05    Failed    Tom Sabestine      M   Berlin
8   A001   Project 9  2.061714e+06   Ongoing       John Alter      M    Paris
9   A003  Project 10  3.000000e+05  Finished    Tom Sabestine      M   Berlin
10  A001  Project 11  2.000000e+06    Failed       John Alter      M    Paris
11  A004  Project 12  1.000000e+06   Ongoing       Nina Adgra      F  Newyork
12  A004  Project 13  3.000000e+06  Finished       Nina Adgra      F  Newyork
13  A005  Project 14  2.000000e+05  Finished        Amy Johny      F   Madrid

    Age  Designation Level
0    25                  2
1    27                  2
2    29                  3
3    31                  2
4    30                  3
5    27                  2
6    30                  3
7    29                  3
8    25                  2
9    29                  3
10   25                  2
11   31                  2
12   31                  2
13   30                  3

Task 5 Add a new bonus column in the Final dataframe. Give a 5% bonus concerning project cost only to employees who have finished the projects.

In [67]:
# Add a new 'Bonus' column
Final['Bonus'] = Final.apply(lambda row: row['Cost'] * 0.05 if row['Status'] == 'Finished' else 0, axis=1)

# Display the updated dataframe
print(Final)

      ID     Project          Cost    Status             Name Gender     City  \
0   A001   Project 1  1.002000e+06  Finished       John Alter      M    Paris
1   A002   Project 2  2.000000e+06   Ongoing  Alice Luxumberg      F   London
2   A003   Project 3  4.500000e+06  Finished    Tom Sabestine      M   Berlin
3   A004   Project 4  5.500000e+06   Ongoing       Nina Adgra      F  Newyork
4   A005   Project 5  3.250500e+06  Finished        Amy Johny      F   Madrid
5   A002   Project 6  6.800000e+05    Failed  Alice Luxumberg      F   London
6   A005   Project 7  4.000000e+05  Finished        Amy Johny      F   Madrid
7   A003   Project 8  3.500000e+05    Failed    Tom Sabestine      M   Berlin
8   A001   Project 9  2.061714e+06   Ongoing       John Alter      M    Paris
9   A003  Project 10  3.000000e+05  Finished    Tom Sabestine      M   Berlin
10  A001  Project 11  2.000000e+06    Failed       John Alter      M    Paris
11  A004  Project 12  1.000000e+06   Ongoing       Nina Adgra      F  Newyork
12  A004  Project 13  3.000000e+06  Finished       Nina Adgra      F  Newyork
13  A005  Project 14  2.000000e+05  Finished        Amy Johny      F   Madrid

    Age  Designation Level     Bonus
0    25                  2   50100.0
1    27                  2       0.0
2    29                  3  225000.0
3    31                  2       0.0
4    30                  3  162525.0
5    27                  2       0.0
6    30                  3   20000.0
7    29                  3       0.0
8    25                  2       0.0
9    29                  3   15000.0
10   25                  2       0.0
11   31                  2       0.0
12   31                  2  150000.0
13   30                  3   10000.0

Task-6 Demote the designation level by 1, whose projects have status “fail”. Delete the employees record whose designation level is above 4.

In [69]:
# Demote designation level by 1 for employees whose project status is "fail"
Final['Designation Level'] = Final.apply(
    lambda row:row['Designation Level'] - 1 if row['Status'] == 'fail' else row['Designation Level'],
    axis=1
)

# Delete employee records whose designation level is above 4
Final = Final[Final['Designation Level'] <= 4]

# Display the updated dataframe
print(Final)

      ID     Project          Cost    Status             Name Gender     City  \
0   A001   Project 1  1.002000e+06  Finished       John Alter      M    Paris
1   A002   Project 2  2.000000e+06   Ongoing  Alice Luxumberg      F   London
2   A003   Project 3  4.500000e+06  Finished    Tom Sabestine      M   Berlin
3   A004   Project 4  5.500000e+06   Ongoing       Nina Adgra      F  Newyork
4   A005   Project 5  3.250500e+06  Finished        Amy Johny      F   Madrid
5   A002   Project 6  6.800000e+05    Failed  Alice Luxumberg      F   London
6   A005   Project 7  4.000000e+05  Finished        Amy Johny      F   Madrid
7   A003   Project 8  3.500000e+05    Failed    Tom Sabestine      M   Berlin
8   A001   Project 9  2.061714e+06   Ongoing       John Alter      M    Paris
9   A003  Project 10  3.000000e+05  Finished    Tom Sabestine      M   Berlin
10  A001  Project 11  2.000000e+06    Failed       John Alter      M    Paris
11  A004  Project 12  1.000000e+06   Ongoing       Nina Adgra      F  Newyork
12  A004  Project 13  3.000000e+06  Finished       Nina Adgra      F  Newyork
13  A005  Project 14  2.000000e+05  Finished        Amy Johny      F   Madrid

    Age  Designation Level     Bonus
0    25                  2   50100.0
1    27                  2       0.0
2    29                  3  225000.0
3    31                  2       0.0
4    30                  3  162525.0
5    27                  2       0.0
6    30                  3   20000.0
7    29                  3       0.0
8    25                  2       0.0
9    29                  3   15000.0
10   25                  2       0.0
11   31                  2       0.0
12   31                  2  150000.0
13   30                  3   10000.0

Task-7 Add “Mr.” and “Mrs.” to the first name column and drop the gender column.

In [70]:
employee_df = pd.DataFrame(EmployeeDataFrame)

# Add "Mr." or "Mrs." to the name column based on gender
employee_df['first_name'] = employee_df.apply(
    lambda row: f"Mr. {row['Name']}" if row['Gender'] == 'M' else f"Mrs. {row['Name']}",
    axis=1
)
# Display the updated dataframe
print(employee_df)

     ID             Name Gender     City  Age            first_name
0  A001       John Alter      M    Paris   25        Mr. John Alter
1  A002  Alice Luxumberg      F   London   27  Mrs. Alice Luxumberg
2  A003    Tom Sabestine      M   Berlin   29     Mr. Tom Sabestine
3  A004       Nina Adgra      F  Newyork   31       Mrs. Nina Adgra
4  A005        Amy Johny      F   Madrid   30        Mrs. Amy Johny

Task - 8 Promote designation level by 1 for the employees whose age is more than 29 years using IF condition.

In [71]:
# Promote designation level by 1 for employees whose age is greater than 29
employee_df = pd.DataFrame(EmployeeDataFrame)
employee_df['Designation Level'] = Final.apply(
    lambda row: row['Designation Level'] + 1 if row['Age'] > 29 else row['Designation Level'],
    axis=1)
# Display the updated dataframe
print(employee_df)

     ID             Name Gender     City  Age  Designation Level
0  A001       John Alter      M    Paris   25                  2
1  A002  Alice Luxumberg      F   London   27                  2
2  A003    Tom Sabestine      M   Berlin   29                  3
3  A004       Nina Adgra      F  Newyork   31                  3
4  A005        Amy Johny      F   Madrid   30                  4

Task9 - Add the cost of all projects for each Employee and save it in new dataframe “TotalProjCost” with three columns ID, First Name, and Total cost

In [72]:
#Group by employee_id and first_name, then sum project costs
TotalProjCost = Final.groupby(['ID', 'Name'], as_index=False)['Cost'].sum()
# Display the new TotalProjCost dataframe
print(TotalProjCost)

     ID             Name          Cost
0  A001       John Alter  5.063714e+06
1  A002  Alice Luxumberg  2.680000e+06
2  A003    Tom Sabestine  5.150000e+06
3  A004       Nina Adgra  9.500000e+06
4  A005        Amy Johny  3.850500e+06

Task10 - Print all the employee details whose city name contains the letter “o” in it.

In [73]:
# Filter employees whose city contains the letter 'o'
Employees_filter = Final[Final['City'].str.contains('o', case=False, na=False)]

# Print the filtered dataframe
print(Employees_filter)

      ID     Project       Cost    Status             Name Gender     City  \
1   A002   Project 2  2000000.0   Ongoing  Alice Luxumberg      F   London
3   A004   Project 4  5500000.0   Ongoing       Nina Adgra      F  Newyork
5   A002   Project 6   680000.0    Failed  Alice Luxumberg      F   London
11  A004  Project 12  1000000.0   Ongoing       Nina Adgra      F  Newyork
12  A004  Project 13  3000000.0  Finished       Nina Adgra      F  Newyork

    Age  Designation Level     Bonus
1    27                  2       0.0
3    31                  2       0.0
5    27                  2       0.0
11   31                  2       0.0
12   31                  2  150000.0